inv=["egg", "spoon", "rozetka", "mashina", "baby"]
print("вы идёте по лесу и встречаете медведя.")
print("Вы отлично знаете, что все медведи боятся яиц")
a1 = input("выберете предмет: ")
if a1 in inv:
    if a1 == "egg":
        print("отлично! У вас в кармане было яйцо и вы кинули его в бедалагу.")
    elif a1 !==:
        print("Вы досали обсалютно не нужный предмет и вас разарвали!")
        break
else:
    print("вы обрыли все карманы в поиске этого предмета, но неичего не нашли и вам порвали попку.")
    break

print("Медведь в шоке! Вы пошли дальше и вышли к пруду")
print("Вы решаете попить из него, но руками нельзя! это челендж")
a2 = input("выберете предмет, чтобы попит: ")
if a2 in inv:
    if a2 == "spoon":
        print("Вы напились в доволь и вы довольны!")
    elif a2 !==:
        print("О нет! Вы не попили, потому что взяли какой - то трэш!!!!111!!11!!1111!!01010101")
        break
    else:
        print("вы не нашли этот предмет и сдохли от жажды")
        break
print("Вы попили и пошли дальше.")
print("О нет! За вами бежит монстр! Покормите его чтобы он отстал.")
a3 = input("выберете еду для монтсра: ")
if a3 in inv:
    if a3 == "baby":
        print("Вы отдали ему на съедение мальнького ребёнка и пошли домой спать. ПОБЕДА!")
    else:
        print("Вас съели и всё, ему пофек какта")
        
        